app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(params.require(:article))
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2018-12-17 10:41:18.406377"], ["id", 1]]